--------------------------------------------------------------------------------------------------------------
-- Visualiza todas conexões abertas
--------------------------------------------------------------------------------------------------------------
SELECT *
FROM master.dbo.sysprocesses
WHERE dbid = DB_ID('gescooper90_homolog')


--------------------------------------------------------------------------------------------------------------
-- Quantidade de Conexões por banco de dados
--------------------------------------------------------------------------------------------------------------
SELECT db_name(dbid) as Banco_de_Dados,
count(dbid) as Qtd_Conexoes
FROM sys.sysprocesses
WHERE --dbid > 50
db_name(dbid) = 'gescooper90_homolog'
GROUP BY dbid, loginame -- agrupado por número de sessões abertas por usuário


/*************************************************************************************************************/
--------------------------------------------------------------------------------------------------------------
-- Colocando o Banco de Dados para Single_User 
--------------------------------------------------------------------------------------------------------------
Alter Database Maintenance
Set Single_User With Rollback Immediate


--------------------------------------------------------------------------------------------------------------
-- Colocando o Banco de Dados que esta como Single_User para Multi_User
--------------------------------------------------------------------------------------------------------------
Alter Database Maintenance
Set Multi_User With Rollback Immediate


/*************************************************************************************************************/


